// B.cpp : このファイルには 'main' 関数が含まれています。プログラム実行の開始と終了がそこで行われます。
//

#include <iostream>
#include<string>

using namespace std;

int main()
{
    string s, s1, s2;
    cin >> s;
    s1 = s.substr(0, 2);
    s2 = s.substr(2, 2);

    if ((s1 == "01" || s1 == "02" || s1 == "03" || s1 == "04" || s1 == "05" || s1 == "06" ||
        s1 == "07" || s1 == "08" || s1 == "09" || s1 == "10" || s1 == "11" || s1 == "12")&&
        (s2 == "01" || s2 == "02" || s2 == "03" || s2 == "04" || s2 == "05" || s2 == "06" ||
            s2 == "07" || s2 == "08" || s2 == "09" || s2 == "10" || s2 == "11" || s2 == "12")) {
        cout << "AMBIGUOUS" << endl;
    }
    else if (s1 == "01" || s1 == "02" || s1 == "03" || s1 == "04" || s1 == "05" || s1 == "06" ||
        s1 == "07" || s1 == "08" || s1 == "09" || s1 == "10" || s1 == "11" || s1 == "12") {
        cout << "MMYY" << endl;
    }
    else if (s2 == "01" || s2 == "02" || s2 == "03" || s2 == "04" || s2 == "05" || s2 == "06" ||
        s2 == "07" || s2 == "08" || s2 == "09" || s2 == "10" || s2 == "11" || s2 == "12") {
        cout << "YYMM" << endl;
    }
    else {
        cout << "NA" << endl;
    }

    return 0;

}

