#include <bits/stdc++.h>
using namespace std;

int main() {
  int H, W;
  cin >> H >> W;
  string zentai = "";

  for (int i = 0; i < H; i++) {
    string s;
    cin >> s;
    zentai += s;
  }

  for (int i = 0; i < H * W; i++){
    if (zentai.at(i) == '#') {
      cout << '#';
    } else if (zentai.at(i) == '.'){
      	int count = 0;
      	int x = i % W;
      	int y = i / W;

//////// xが0より大きくyも0より大きく、iの（左隣 + 1段上）が # だったら
//////// ↓
//////// iが一番左ではなく一番上でもなく、iの左上が # だったら

      	if (x - 1 >= 0 && y - 1 >= 0 && zentai.at(x - 1 + (y - 1) * W) == '#'){
        	count++;
      	}

//////// yが0より大きく、iの（1段上）が # だったら
//////// ↓
//////// iが一番上ではなく、iの上が # だったら

      	if (y - 1 >= 0 && zentai.at(x + (y - 1) * W) == '#'){
        	count++;
      	}

//////// xがW - 1より小さくyが0より大きく、iの（右隣 + 1段上）が # だったら
//////// ↓
//////// iが一番右ではなく一番上でもなく、iの右上が # だったら

      	if (x + 1 < W && y - 1 >= 0 && zentai.at(x + 1 + (y - 1) * W) == '#'){
        	count++;
      	}

//////// xが0より大きく、iの（左隣）が # だったら
//////// ↓
//////// iが一番左ではなく、iの左が # だったら

      	if (x - 1 >= 0 && zentai.at(x - 1 + y * W) == '#'){
        	count++;
      	}

//////// xがW - 1より小さく、iの（右隣）が # だったら
//////// ↓
//////// iが一番右ではなく、iの右が # だったら

      	if (x + 1 < W && zentai.at(x + 1 + y * W) == '#'){
        	count++;
      	}

//////// xが0より大きくyがH - 1より小さく、iの（左隣 + 1段下）が # だったら
//////// ↓
//////// iが一番左ではなく一番下でもなく、iの左下が # だったら

      	if (x - 1 >= 0 && y + 1 < H && zentai.at(x - 1 + (y + 1) * W) == '#'){
        	count++;
      	}

//////// yがH - 1より小さく、iの（1段下）が # だったら
//////// ↓
//////// iが一番下ではなく、iの下が # だったら

      	if (y + 1 < H && zentai.at(x + (y + 1) * W) == '#'){
        	count++;
      	}

//////// xがW - 1より小さくyがH - 1より小さく、iの（右隣 + 1段下）が # だったら
//////// ↓
//////// iが一番右ではなく一番下でもなく、iの右下が # だったら

      	if (x + 1 < W && y + 1 < H && zentai.at(x + 1 + (y + 1) * W) == '#'){
        	count++;
      	}

      cout << count;
    }

    if ((i + 1) % W == 0){
      cout << endl;
    }
  }
}