#include <bits/stdc++.h>
using namespace std;
using ll=long long;
/*
N^2
4 5 5 6
100
101
101
110
010=2
4^5=1
5^6=11=3
1^3=2

6
4 6 0 0 3 3
0 5 6 5 0 3

000
101
110
101
000
011
101=5

100
110
011
011
010=2

6
4 6 0 0 3 3
0 5 6 5 0 3
set消す
4 6
6 3
10 7 12 9
1010
0111
1100
1001
1000=8

bの論理和とってaとN通り
Nを論理和とっておしまい？
んなこたない

3+7
繰り上がりがやっかい
ペアはけしていい
繰り上がるのと繰り上がらないのとの積を出す？
3 4 5
4 6 8
16=0
8=8通り -8する
-4 -2 0
4=2通り
-4-6-4
logNを28桁
Nを28回
200000を29回sort=86ms
N回lowerをするのはNGか
繰り上がりが何回あるかを記録しとくとか

2
1 2
3 4

A[0,1,1]
B[1,1,1]
=[1,2,2]和でいいの？
=[1,3,0]
=[2,3,0]
=[0,1,0]
=2

2
1 1
3 4
4,5,4,5=0
[0,0,0]
[1,1,1]
[1,1,3]
[1,2,1]
[0,0,1]=1

3
2 3 4
3 4 5
=5,6,7,6,7,8,7,8,9
=5,7,9
1001
0111
0101
1011=11
  [1,2,1]
  [2,1,2]
全部で3
2*2+1*1=5//1の位(N-A)*B+N*(N-B)
1*2=2//1から繰り上がる
[0,0,2,5]//1
[0,2,5,0]//2
[2,5,0,0]
[2,7,7,5]
[3,6,5,5]になるはず

[0,1,0,5]//1
[1,0,5,0]//2
[2,5,0,0]
[3,6,6,5]//さらに繰り上がるやつとそうでない奴を管理できない

3+5が管理できない
 101
 011
1000
5,6,6,7,7,7,8,8,9
0101
0110
0111
1000
1001
3655

1+7とか

やっぱlowerのNlogNか
0桁目 mod2 自分が0なら1 1なら0の数
1桁目 mod4 自分が0なら2-3 1なら12 3なら03か
1,3 2-1 4-3
23,67　2個 4-2 8-6
4567,12131415 4個 8-4 16-12
8,24 *3すればいいか
厄介
0桁目 mod4 13ならOK？
1桁目 mod8 
4で割る
むり、

2
1 2
3 4

1 0
1 0

1 2
3 0

*/
int main(){
  ll N,ans=0; cin>>N;
  vector<ll> A(N,0),B(N,0),C(N,0);
  for(ll i=0; i<N; i++) cin>>A[i];
  for(ll i=0; i<N; i++) cin>>B[i];
  for(ll i=1; i<=29; i++){//28条まで
    ll n=1<<i;
    for(ll j=0; j<N; j++) C[j]=B[j]%n;
    sort(C.begin(), C.end());
    ll tmp=0;
    for(ll j=0; j<N; j++){
      ll m=A[j]%n;
//cout<<"m:"<<m<<endl;      
      auto a1=lower_bound(C.begin(), C.end(), n-m);
      auto a2=lower_bound(C.begin(), C.end(), n/2-m);
      auto b1=lower_bound(C.begin(), C.end(), n*2-m);
      auto b2=lower_bound(C.begin(), C.end(), n/2*3-m);
      (tmp+=a1-a2+b1-b2)%=2;
//cout<<"a:"<<a1-a2<<" b:"<<b1-b2<<" ans:"<<ans<<endl;      
    }
    ans+=tmp%2*n/2;
  }
  cout<<ans<<endl;
}